/*
 * Copyright © 2022 Алексей Каленчуков
 * GitHub: https://github.com/kalenchukov
 * E-mail: mailto:aleksey.kalenchukov@yandex.ru
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

package dev.kalenchukov.html.resources;

import org.jetbrains.annotations.NotNull;

/**
 * Перечисление HTML-сущностей.
 */
public enum Entity
{
	/**
	 * Символ &#193;.
	 */
	AACUTE('Á', "Aacute", "193", "C1"),

	/**
	 * Символ &#225;.
	 */
	AACUTE2('á', "aacute", "225", "E1"),

	/**
	 * Символ &#258;.
	 */
	ABREVE('Ă', "Abreve", "258", "102"),

	/**
	 * Символ &#259;.
	 */
	ABREVE2('ă', "abreve", "259", "103"),

	/**
	 * Символ &#8766;.
	 */
	AC('∾', "ac", "8766", "223E"),

	/**
	 * Символ &#8767;.
	 */
	ACD('∿', "acd", "8767", "223F"),

	/**
	 * Символ &#194;.
	 */
	ACIRC('Â', "Acirc", "194", "C2"),

	/**
	 * Символ &#226;.
	 */
	ACIRC2('â', "acirc", "226", "E2"),

	/**
	 * Символ &#180;.
	 */
	ACUTE('´', "acute", "180", "B4"),

	/**
	 * Символ &#198;.
	 */
	AELIG('Æ', "AElig", "198", "C6"),

	/**
	 * Символ &#230;.
	 */
	AELIG2('æ', "aelig", "230", "E6"),

	/**
	 * Символ &#192;.
	 */
	AGRAVE('À', "Agrave", "192", "C0"),

	/**
	 * Символ &#224;.
	 */
	AGRAVE2('à', "agrave", "224", "E0"),

	/**
	 * Символ &#8501;.
	 */
	ALEFSYM('ℵ', "alefsym", "8501", "2135"),

	/**
	 * Символ &#913;.
	 */
	ALPHA('Α', "Alpha", "913", "391"),

	/**
	 * Символ &#945;.
	 */
	ALPHA2('α', "alpha", "945", "3B1"),

	/**
	 * Символ &#256;.
	 */
	AMACR('Ā', "Amacr", "256", "100"),

	/**
	 * Символ &#257;.
	 */
	AMACR2('ā', "amacr", "257", "101"),

	/**
	 * Символ &#38;.
	 */
	AMP('&', "amp", "38", "26"),

	/**
	 * Символ &#8743;.
	 */
	AND('∧', "and", "8743", "2227"),

	/**
	 * Символ &#8736;.
	 */
	ANG('∠', "ang", "8736", "2220"),

	/**
	 * Символ &#8737;.
	 */
	ANGMSD('∡', "angmsd", "8737", "2221"),

	/**
	 * Символ &#8735;.
	 */
	ANGRT('∟', "angrt", "8735", "221F"),

	/**
	 * Символ &#8894;.
	 */
	ANGRTVB('⊾', "angrtvb", "8894", "22BE"),

	/**
	 * Символ &#8738;.
	 */
	ANGSPH('∢', "angsph", "8738", "2222"),

	/**
	 * Символ &#260;.
	 */
	AOGON('Ą', "Aogon", "260", "104"),

	/**
	 * Символ &#261;.
	 */
	AOGON2('ą', "aogon", "261", "105"),

	/**
	 * Символ &#8779;.
	 */
	APID('≋', "apid", "8779", "224B"),

	/**
	 * Символ &#39;.
	 */
	APOS('\'', "apos", "39", "27"),

	/**
	 * Символ &#8778;.
	 */
	APPROXEQ('≊', "approxeq", "8778", "224A"),

	/**
	 * Символ &#197;.
	 */
	ARING('Å', "Aring", "197", "C5"),

	/**
	 * Символ &#229;.
	 */
	ARING2('å', "aring", "229", "E5"),

	/**
	 * Символ &#42;.
	 */
	AST('*', "ast", "42", "2A"),

	/**
	 * Символ &#8776;.
	 */
	ASYMP('≈', "asymp", "8776", "2248"),

	/**
	 * Символ &#8781;.
	 */
	ASYMPEQ('≍', "asympeq", "8781", "224D"),

	/**
	 * Символ &#195;.
	 */
	ATILDE('Ã', "Atilde", "195", "C3"),

	/**
	 * Символ &#227;.
	 */
	ATILDE2('ã', "atilde", "227", "E3"),

	/**
	 * Символ &#196;.
	 */
	AUML('Ä', "Auml", "196", "C4"),

	/**
	 * Символ &#228;.
	 */
	AUML2('ä', "auml", "228", "E4"),

	/**
	 * Символ &#8755;.
	 */
	AWCONINT('∳', "awconint", "8755", "2233"),

	/**
	 * Символ &#8893;.
	 */
	BARVEE('⊽', "barvee", "8893", "22BD"),

	/**
	 * Символ &#8780;.
	 */
	BCONG('≌', "bcong", "8780", "224C"),

	/**
	 * Символ &#8222;.
	 */
	BDQUO('„', "bdquo", "8222", "201E"),

	/**
	 * Символ &#8757;.
	 */
	BECAUSE('∵', "because", "8757", "2235"),

	/**
	 * Символ &#8492;.
	 */
	BERNOU('ℬ', "bernou", "8492", "212C"),

	/**
	 * Символ &#914;.
	 */
	BETA('Β', "Beta", "914", "392"),

	/**
	 * Символ &#946;.
	 */
	BETA2('β', "beta", "946", "3B2"),

	/**
	 * Символ &#8502;.
	 */
	BETH('ℶ', "beth", "8502", "2136"),

	/**
	 * Символ &#8812;.
	 */
	BETWEEN('≬', "between", "8812", "226C"),

	/**
	 * Символ &#8904;.
	 */
	BOWTIE('⋈', "bowtie", "8904", "22C8"),

	/**
	 * Символ &#8245;.
	 */
	BPRIME('‵', "bprime", "8245", "2035"),

	/**
	 * Символ &#166;.
	 */
	BRVBAR('¦', "brvbar", "166", "A6"),

	/**
	 * Символ &#8271;.
	 */
	BSEMI('⁏', "bsemi", "8271", "204F"),

	/**
	 * Символ &#8765;.
	 */
	BSIM('∽', "bsim", "8765", "223D"),

	/**
	 * Символ &#8909;.
	 */
	BSIME('⋍', "bsime", "8909", "22CD"),

	/**
	 * Символ &#92;.
	 */
	BSOL('\\', "bsol", "92", "5C"),

	/**
	 * Символ &#8226;.
	 */
	BULL('•', "bull", "8226", "2022"),

	/**
	 * Символ &#8782;.
	 */
	BUMP('≎', "bump", "8782", "224E"),

	/**
	 * Символ &#8783;.
	 */
	BUMPE('≏', "bumpe", "8783", "224F"),

	/**
	 * Символ &#262;.
	 */
	CACUTE('Ć', "Cacute", "262", "106"),

	/**
	 * Символ &#263;.
	 */
	CACUTE2('ć', "cacute", "263", "107"),

	/**
	 * Символ &#8745;.
	 */
	CAP('∩', "cap", "8745", "2229"),

	/**
	 * Символ &#8914;.
	 */
	CAP2('⋒', "Cap", "8914", "22D2"),

	/**
	 * Символ &#8257;.
	 */
	CARET('⁁', "caret", "8257", "2041"),

	/**
	 * Символ &#268;.
	 */
	CCARON('Č', "Ccaron", "268", "10C"),

	/**
	 * Символ &#269;.
	 */
	CCARON2('č', "ccaron", "269", "10D"),

	/**
	 * Символ &#199;.
	 */
	CCEDIL('Ç', "Ccedil", "199", "C7"),

	/**
	 * Символ &#231;.
	 */
	CCEDIL2('ç', "ccedil", "231", "E7"),

	/**
	 * Символ &#264;.
	 */
	CCIRC('Ĉ', "Ccirc", "264", "108"),

	/**
	 * Символ &#265;.
	 */
	CCIRC2('ĉ', "ccirc", "265", "109"),

	/**
	 * Символ &#8752;.
	 */
	CCONINT('∰', "Cconint", "8752", "2230"),

	/**
	 * Символ &#266;.
	 */
	CDOT('Ċ', "Cdot", "266", "10A"),

	/**
	 * Символ &#267;.
	 */
	CDOT2('ċ', "cdot", "267", "10B"),

	/**
	 * Символ &#184;.
	 */
	CEDIL('¸', "cedil", "184", "B8"),

	/**
	 * Символ &#162;.
	 */
	CENT('¢', "cent", "162", "A2"),

	/**
	 * Символ &#8493;.
	 */
	CFR('ℭ', "Cfr", "8493", "212D"),

	/**
	 * Символ &#10003;.
	 */
	CHECK('✓', "check", "10003", "2713"),

	/**
	 * Символ &#935;.
	 */
	CHI('Χ', "Chi", "935", "3A7"),

	/**
	 * Символ &#967;.
	 */
	CHI2('χ', "chi", "967", "3C7"),

	/**
	 * Символ &#710;.
	 */
	CIRC('ˆ', "circ", "710", "2C6"),

	/**
	 * Символ &#8791;.
	 */
	CIRE('≗', "cire", "8791", "2257"),

	/**
	 * Символ &#9827;.
	 */
	CLUBS('♣', "clubs", "9827", "2663"),

	/**
	 * Символ &#58;.
	 */
	COLON(':', "colon", "58", "3A"),

	/**
	 * Символ &#8759;.
	 */
	COLON2('∷', "Colon", "8759", "2237"),

	/**
	 * Символ &#8788;.
	 */
	COLONE('≔', "colone", "8788", "2254"),

	/**
	 * Символ &#44;.
	 */
	COMMA(',', "comma", "44", "2C"),

	/**
	 * Символ &#64;.
	 */
	COMMAT('@', "commat", "64", "40"),

	/**
	 * Символ &#8705;.
	 */
	COMP('∁', "comp", "8705", "2201"),

	/**
	 * Символ &#8728;.
	 */
	COMPFN('∘', "compfn", "8728", "2218"),

	/**
	 * Символ &#8773;.
	 */
	CONG('≅', "cong", "8773", "2245"),

	/**
	 * Символ &#8750;.
	 */
	CONINT('∮', "conint", "8750", "222E"),

	/**
	 * Символ &#8751;.
	 */
	CONINT2('∯', "Conint", "8751", "222F"),

	/**
	 * Символ &#8450;.
	 */
	COPF('ℂ', "Copf", "8450", "2102"),

	/**
	 * Символ &#8720;.
	 */
	COPROD('∐', "coprod", "8720", "2210"),

	/**
	 * Символ &#169;.
	 */
	COPY('©', "copy", "169", "A9"),

	/**
	 * Символ &#8471;.
	 */
	COPYSR('℗', "copysr", "8471", "2117"),

	/**
	 * Символ &#10007;.
	 */
	CROSS('✗', "cross", "10007", "2717"),

	/**
	 * Символ &#8943;.
	 */
	CTDOT('⋯', "ctdot", "8943", "22EF"),

	/**
	 * Символ &#10552;.
	 */
	CUDARRL('⤸', "cudarrl", "10552", "2938"),

	/**
	 * Символ &#10549;.
	 */
	CUDARRR('⤵', "cudarrr", "10549", "2935"),

	/**
	 * Символ &#8926;.
	 */
	CUEPR('⋞', "cuepr", "8926", "22DE"),

	/**
	 * Символ &#8927;.
	 */
	CUESC('⋟', "cuesc", "8927", "22DF"),

	/**
	 * Символ &#10557;.
	 */
	CULARRP('⤽', "cularrp", "10557", "293D"),

	/**
	 * Символ &#8746;.
	 */
	CUP('∪', "cup", "8746", "222A"),

	/**
	 * Символ &#8915;.
	 */
	CUP2('⋓', "Cup", "8915", "22D3"),

	/**
	 * Символ &#8845;.
	 */
	CUPDOT('⊍', "cupdot", "8845", "228D"),

	/**
	 * Символ &#10556;.
	 */
	CURARRM('⤼', "curarrm", "10556", "293C"),

	/**
	 * Символ &#164;.
	 */
	CURREN('¤', "curren", "164", "A4"),

	/**
	 * Символ &#8910;.
	 */
	CUVEE('⋎', "cuvee", "8910", "22CE"),

	/**
	 * Символ &#8911;.
	 */
	CUWED('⋏', "cuwed", "8911", "22CF"),

	/**
	 * Символ &#8754;.
	 */
	CWCONINT('∲', "cwconint", "8754", "2232"),

	/**
	 * Символ &#8753;.
	 */
	CWINT('∱', "cwint", "8753", "2231"),

	/**
	 * Символ &#8224;.
	 */
	DAGGER('†', "dagger", "8224", "2020"),

	/**
	 * Символ &#8225;.
	 */
	DAGGER2('‡', "Dagger", "8225", "2021"),

	/**
	 * Символ &#8504;.
	 */
	DALETH('ℸ', "daleth", "8504", "2138"),

	/**
	 * Символ &#8659;.
	 */
	DARR('⇓', "dArr", "8659", "21D3"),

	/**
	 * Символ &#8867;.
	 */
	DASHV('⊣', "dashv", "8867", "22A3"),

	/**
	 * Символ &#270;.
	 */
	DCARON('Ď', "Dcaron", "270", "10E"),

	/**
	 * Символ &#271;.
	 */
	DCARON2('ď', "dcaron", "271", "10F"),

	/**
	 * Символ &#8517;.
	 */
	DD('ⅅ', "DD", "8517", "2145"),

	/**
	 * Символ &#8518;.
	 */
	DD2('ⅆ', "dd", "8518", "2146"),

	/**
	 * Символ &#8650;.
	 */
	DDARR('⇊', "ddarr", "8650", "21CA"),

	/**
	 * Символ &#10513;.
	 */
	DDOTRAHD('⤑', "DDotrahd", "10513", "2911"),

	/**
	 * Символ &#176;.
	 */
	DEG('°', "deg", "176", "B0"),

	/**
	 * Символ &#916;.
	 */
	DELTA('Δ', "Delta", "916", "394"),

	/**
	 * Символ &#948;.
	 */
	DELTA2('δ', "delta", "948", "3B4"),

	/**
	 * Символ &#10623;.
	 */
	DFISHT('⥿', "dfisht", "10623", "297F"),

	/**
	 * Символ &#10597;.
	 */
	DHAR('⥥', "dHar", "10597", "2965"),

	/**
	 * Символ &#8643;.
	 */
	DHARL('⇃', "dharl", "8643", "21C3"),

	/**
	 * Символ &#8642;.
	 */
	DHARR('⇂', "dharr", "8642", "21C2"),

	/**
	 * Символ &#8900;.
	 */
	DIAMOND('⋄', "diamond", "8900", "22C4"),

	/**
	 * Символ &#9830;.
	 */
	DIAMS('♦', "diams", "9830", "2666"),

	/**
	 * Символ &#8946;.
	 */
	DISIN('⋲', "disin", "8946", "22F2"),

	/**
	 * Символ &#247;.
	 */
	DIVIDE('÷', "divide", "247", "F7"),

	/**
	 * Символ &#8903;.
	 */
	DIVONX('⋇', "divonx", "8903", "22C7"),

	/**
	 * Символ &#36;.
	 */
	DOLLAR('$', "dollar", "36", "24"),

	/**
	 * Символ &#10515;.
	 */
	DOWNARROWBAR('⤓', "DownArrowBar", "10515", "2913"),

	/**
	 * Символ &#785;.
	 */
	DOWNBREVE('̑', "DownBreve", "785", "311"),

	/**
	 * Символ &#10576;.
	 */
	DOWNLEFTRIGHTVECTOR('⥐', "DownLeftRightVector", "10576", "2950"),

	/**
	 * Символ &#10590;.
	 */
	DOWNLEFTTEEVECTOR('⥞', "DownLeftTeeVector", "10590", "295E"),

	/**
	 * Символ &#10582;.
	 */
	DOWNLEFTVECTORBAR('⥖', "DownLeftVectorBar", "10582", "2956"),

	/**
	 * Символ &#10591;.
	 */
	DOWNRIGHTTEEVECTOR('⥟', "DownRightTeeVector", "10591", "295F"),

	/**
	 * Символ &#10583;.
	 */
	DOWNRIGHTVECTORBAR('⥗', "DownRightVectorBar", "10583", "2957"),

	/**
	 * Символ &#272;.
	 */
	DSTROK('Đ', "Dstrok", "272", "110"),

	/**
	 * Символ &#273;.
	 */
	DSTROK2('đ', "dstrok", "273", "111"),

	/**
	 * Символ &#8945;.
	 */
	DTDOT('⋱', "dtdot", "8945", "22F1"),

	/**
	 * Символ &#8693;.
	 */
	DUARR('⇵', "duarr", "8693", "21F5"),

	/**
	 * Символ &#10607;.
	 */
	DUHAR('⥯', "duhar", "10607", "296F"),

	/**
	 * Символ &#10239;.
	 */
	DZIGRARR('⟿', "dzigrarr", "10239", "27FF"),

	/**
	 * Символ &#201;.
	 */
	EACUTE('É', "Eacute", "201", "C9"),

	/**
	 * Символ &#233;.
	 */
	EACUTE2('é', "eacute", "233", "E9"),

	/**
	 * Символ &#282;.
	 */
	ECARON('Ě', "Ecaron", "282", "11A"),

	/**
	 * Символ &#283;.
	 */
	ECARON2('ě', "ecaron", "283", "11B"),

	/**
	 * Символ &#8790;.
	 */
	ECIR('≖', "ecir", "8790", "2256"),

	/**
	 * Символ &#202;.
	 */
	ECIRC('Ê', "Ecirc", "202", "CA"),

	/**
	 * Символ &#234;.
	 */
	ECIRC2('ê', "ecirc", "234", "EA"),

	/**
	 * Символ &#8789;.
	 */
	ECOLON('≕', "ecolon", "8789", "2255"),

	/**
	 * Символ &#278;.
	 */
	EDOT('Ė', "Edot", "278", "116"),

	/**
	 * Символ &#279;.
	 */
	EDOT2('ė', "edot", "279", "117"),

	/**
	 * Символ &#8785;.
	 */
	EDOT3('≑', "eDot", "8785", "2251"),

	/**
	 * Символ &#8519;.
	 */
	EE('ⅇ', "ee", "8519", "2147"),

	/**
	 * Символ &#8786;.
	 */
	EFDOT('≒', "efDot", "8786", "2252"),

	/**
	 * Символ &#200;.
	 */
	EGRAVE('È', "Egrave", "200", "C8"),

	/**
	 * Символ &#232;.
	 */
	EGRAVE2('è', "egrave", "232", "E8"),

	/**
	 * Символ &#8467;.
	 */
	ELL('ℓ', "ell", "8467", "2113"),

	/**
	 * Символ &#274;.
	 */
	EMACR('Ē', "Emacr", "274", "112"),

	/**
	 * Символ &#275;.
	 */
	EMACR2('ē', "emacr", "275", "113"),

	/**
	 * Символ &#8709;.
	 */
	EMPTY('∅', "empty", "8709", "2205"),

	/**
	 * Символ &#8195;.
	 */
	EMSP(' ', "emsp", "8195", "2003"),

	/**
	 * Символ &#330;.
	 */
	ENG('Ŋ', "ENG", "330", "14A"),

	/**
	 * Символ &#331;.
	 */
	ENG2('ŋ', "eng", "331", "14B"),

	/**
	 * Символ &#8194;.
	 */
	ENSP(' ', "ensp", "8194", "2002"),

	/**
	 * Символ &#280;.
	 */
	EOGON('Ę', "Eogon", "280", "118"),

	/**
	 * Символ &#281;.
	 */
	EOGON2('ę', "eogon", "281", "119"),

	/**
	 * Символ &#8917;.
	 */
	EPAR('⋕', "epar", "8917", "22D5"),

	/**
	 * Символ &#917;.
	 */
	EPSILON('Ε', "Epsilon", "917", "395"),

	/**
	 * Символ &#949;.
	 */
	EPSILON2('ε', "epsilon", "949", "3B5"),

	/**
	 * Символ &#61;.
	 */
	EQUALS('=', "equals", "61", "3D"),

	/**
	 * Символ &#8799;.
	 */
	EQUEST('≟', "equest", "8799", "225F"),

	/**
	 * Символ &#8801;.
	 */
	EQUIV('≡', "equiv", "8801", "2261"),

	/**
	 * Символ &#10609;.
	 */
	ERARR('⥱', "erarr", "10609", "2971"),

	/**
	 * Символ &#8787;.
	 */
	ERDOT('≓', "erDot", "8787", "2253"),

	/**
	 * Символ &#8495;.
	 */
	ESCR('ℯ', "escr", "8495", "212F"),

	/**
	 * Символ &#8496;.
	 */
	ESCR2('ℰ', "Escr", "8496", "2130"),

	/**
	 * Символ &#8784;.
	 */
	ESDOT('≐', "esdot", "8784", "2250"),

	/**
	 * Символ &#8770;.
	 */
	ESIM('≂', "esim", "8770", "2242"),

	/**
	 * Символ &#919;.
	 */
	ETA('Η', "Eta", "919", "397"),

	/**
	 * Символ &#951;.
	 */
	ETA2('η', "eta", "951", "3B7"),

	/**
	 * Символ &#208;.
	 */
	ETH('Ð', "ETH", "208", "D0"),

	/**
	 * Символ &#240;.
	 */
	ETH2('ð', "eth", "240", "F0"),

	/**
	 * Символ &#203;.
	 */
	EUML('Ë', "Euml", "203", "CB"),

	/**
	 * Символ &#235;.
	 */
	EUML2('ë', "euml", "235", "EB"),

	/**
	 * Символ &#33;.
	 */
	EXCL('!', "excl", "33", "21"),

	/**
	 * Символ &#8707;.
	 */
	EXIST('∃', "exist", "8707", "2203"),

	/**
	 * Символ &#9792;.
	 */
	FEMALE('♀', "female", "9792", "2640"),

	/**
	 * Символ &#9837;.
	 */
	FLAT('♭', "flat", "9837", "266D"),

	/**
	 * Символ &#402;.
	 */
	FNOF('ƒ', "fnof", "402", "192"),

	/**
	 * Символ &#8704;.
	 */
	FORALL('∀', "forall", "8704", "2200"),

	/**
	 * Символ &#8916;.
	 */
	FORK('⋔', "fork", "8916", "22D4"),

	/**
	 * Символ &#189;.
	 */
	FRAC12('½', "frac12", "189", "BD"),

	/**
	 * Символ &#8531;.
	 */
	FRAC13('⅓', "frac13", "8531", "2153"),

	/**
	 * Символ &#188;.
	 */
	FRAC14('¼', "frac14", "188", "BC"),

	/**
	 * Символ &#8533;.
	 */
	FRAC15('⅕', "frac15", "8533", "2155"),

	/**
	 * Символ &#8537;.
	 */
	FRAC16('⅙', "frac16", "8537", "2159"),

	/**
	 * Символ &#8539;.
	 */
	FRAC18('⅛', "frac18", "8539", "215B"),

	/**
	 * Символ &#8532;.
	 */
	FRAC23('⅔', "frac23", "8532", "2154"),

	/**
	 * Символ &#8534;.
	 */
	FRAC25('⅖', "frac25", "8534", "2156"),

	/**
	 * Символ &#190;.
	 */
	FRAC34('¾', "frac34", "190", "BE"),

	/**
	 * Символ &#8535;.
	 */
	FRAC35('⅗', "frac35", "8535", "2157"),

	/**
	 * Символ &#8540;.
	 */
	FRAC38('⅜', "frac38", "8540", "215C"),

	/**
	 * Символ &#8536;.
	 */
	FRAC45('⅘', "frac45", "8536", "2158"),

	/**
	 * Символ &#8538;.
	 */
	FRAC56('⅚', "frac56", "8538", "215A"),

	/**
	 * Символ &#8541;.
	 */
	FRAC58('⅝', "frac58", "8541", "215D"),

	/**
	 * Символ &#8542;.
	 */
	FRAC78('⅞', "frac78", "8542", "215E"),

	/**
	 * Символ &#8260;.
	 */
	FRASL('⁄', "frasl", "8260", "2044"),

	/**
	 * Символ &#8497;.
	 */
	FSCR('ℱ', "Fscr", "8497", "2131"),

	/**
	 * Символ &#915;.
	 */
	GAMMA('Γ', "Gamma", "915", "393"),

	/**
	 * Символ &#947;.
	 */
	GAMMA2('γ', "gamma", "947", "3B3"),

	/**
	 * Символ &#286;.
	 */
	GBREVE('Ğ', "Gbreve", "286", "11E"),

	/**
	 * Символ &#287;.
	 */
	GBREVE2('ğ', "gbreve", "287", "11F"),

	/**
	 * Символ &#290;.
	 */
	GCEDIL('Ģ', "Gcedil", "290", "122"),

	/**
	 * Символ &#284;.
	 */
	GCIRC('Ĝ', "Gcirc", "284", "11C"),

	/**
	 * Символ &#285;.
	 */
	GCIRC2('ĝ', "gcirc", "285", "11D"),

	/**
	 * Символ &#288;.
	 */
	GDOT('Ġ', "Gdot", "288", "120"),

	/**
	 * Символ &#289;.
	 */
	GDOT2('ġ', "gdot", "289", "121"),

	/**
	 * Символ &#8805;.
	 */
	GE('≥', "ge", "8805", "2265"),

	/**
	 * Символ &#8807;.
	 */
	GE2('≧', "gE", "8807", "2267"),

	/**
	 * Символ &#8923;.
	 */
	GEL('⋛', "gel", "8923", "22DB"),

	/**
	 * Символ &#8921;.
	 */
	GG('⋙', "Gg", "8921", "22D9"),

	/**
	 * Символ &#8503;.
	 */
	GIMEL('ℷ', "gimel", "8503", "2137"),

	/**
	 * Символ &#8823;.
	 */
	GL('≷', "gl", "8823", "2277"),

	/**
	 * Символ &#8809;.
	 */
	GNE('≩', "gnE", "8809", "2269"),

	/**
	 * Символ &#8935;.
	 */
	GNSIM('⋧', "gnsim", "8935", "22E7"),

	/**
	 * Символ &#96;.
	 */
	GRAVE('`', "grave", "96", "60"),

	/**
	 * Символ &#8458;.
	 */
	GSCR('ℊ', "gscr", "8458", "210A"),

	/**
	 * Символ &#8819;.
	 */
	GSIM('≳', "gsim", "8819", "2273"),

	/**
	 * Символ &#62;.
	 */
	GT('>', "gt", "62", "3E"),

	/**
	 * Символ &#8811;.
	 */
	GT2('≫', "Gt", "8811", "226B"),

	/**
	 * Символ &#8919;.
	 */
	GTDOT('⋗', "gtdot", "8919", "22D7"),

	/**
	 * Символ &#10616;.
	 */
	GTRARR('⥸', "gtrarr", "10616", "2978"),

	/**
	 * Символ &#8459;.
	 */
	HAMILT('ℋ', "hamilt", "8459", "210B"),

	/**
	 * Символ &#8660;.
	 */
	HARR('⇔', "hArr", "8660", "21D4"),

	/**
	 * Символ &#10568;.
	 */
	HARRCIR('⥈', "harrcir", "10568", "2948"),

	/**
	 * Символ &#94;.
	 */
	HAT('^', "Hat", "94", "5E"),

	/**
	 * Символ &#292;.
	 */
	HCIRC('Ĥ', "Hcirc", "292", "124"),

	/**
	 * Символ &#293;.
	 */
	HCIRC2('ĥ', "hcirc", "293", "125"),

	/**
	 * Символ &#9829;.
	 */
	HEARTS('♥', "hearts", "9829", "2665"),

	/**
	 * Символ &#8230;.
	 */
	HELLIP('…', "hellip", "8230", "2026"),

	/**
	 * Символ &#8889;.
	 */
	HERCON('⊹', "hercon", "8889", "22B9"),

	/**
	 * Символ &#8460;.
	 */
	HFR('ℌ', "Hfr", "8460", "210C"),

	/**
	 * Символ &#8703;.
	 */
	HOARR('⇿', "hoarr", "8703", "21FF"),

	/**
	 * Символ &#8763;.
	 */
	HOMTHT('∻', "homtht", "8763", "223B"),

	/**
	 * Символ &#8461;.
	 */
	HOPF('ℍ', "Hopf", "8461", "210D"),

	/**
	 * Символ &#8213;.
	 */
	HORBAR('―', "horbar", "8213", "2015"),

	/**
	 * Символ &#294;.
	 */
	HSTROK('Ħ', "Hstrok", "294", "126"),

	/**
	 * Символ &#295;.
	 */
	HSTROK2('ħ', "hstrok", "295", "127"),

	/**
	 * Символ &#8259;.
	 */
	HYBULL('⁃', "hybull", "8259", "2043"),

	/**
	 * Символ &#8208;.
	 */
	HYPHEN('‐', "hyphen", "8208", "2010"),

	/**
	 * Символ &#237;.
	 */
	IACUTE('í', "iacute", "237", "ED"),

	/**
	 * Символ &#238;.
	 */
	ICIRC('î', "icirc", "238", "EE"),

	/**
	 * Символ &#304;.
	 */
	IDOT('İ', "Idot", "304", "130"),

	/**
	 * Символ &#161;.
	 */
	IEXCL('¡', "iexcl", "161", "A1"),

	/**
	 * Символ &#236;.
	 */
	IGRAVE('ì', "igrave", "236", "EC"),

	/**
	 * Символ &#8520;.
	 */
	II('ⅈ', "ii", "8520", "2148"),

	/**
	 * Символ &#8749;.
	 */
	IIINT('∭', "iiint", "8749", "222D"),

	/**
	 * Символ &#8489;.
	 */
	IIOTA('℩', "iiota", "8489", "2129"),

	/**
	 * Символ &#306;.
	 */
	IJLIG('Ĳ', "IJlig", "306", "132"),

	/**
	 * Символ &#307;.
	 */
	IJLIG2('ĳ', "ijlig", "307", "133"),

	/**
	 * Символ &#298;.
	 */
	IMACR('Ī', "Imacr", "298", "12A"),

	/**
	 * Символ &#299;.
	 */
	IMACR2('ī', "imacr", "299", "12B"),

	/**
	 * Символ &#8465;.
	 */
	IMAGE('ℑ', "image", "8465", "2111"),

	/**
	 * Символ &#305;.
	 */
	IMATH('ı', "imath", "305", "131"),

	/**
	 * Символ &#8887;.
	 */
	IMOF('⊷', "imof", "8887", "22B7"),

	/**
	 * Символ &#8453;.
	 */
	INCARE('℅', "incare", "8453", "2105"),

	/**
	 * Символ &#8734;.
	 */
	INFIN('∞', "infin", "8734", "221E"),

	/**
	 * Символ &#8747;.
	 */
	INT('∫', "int", "8747", "222B"),

	/**
	 * Символ &#8748;.
	 */
	INT2('∬', "Int", "8748", "222C"),

	/**
	 * Символ &#8890;.
	 */
	INTCAL('⊺', "intcal", "8890", "22BA"),

	/**
	 * Символ &#302;.
	 */
	IOGON('Į', "Iogon", "302", "12E"),

	/**
	 * Символ &#303;.
	 */
	IOGON2('į', "iogon", "303", "12F"),

	/**
	 * Символ &#921;.
	 */
	IOTA('Ι', "Iota", "921", "399"),

	/**
	 * Символ &#953;.
	 */
	IOTA2('ι', "iota", "953", "3B9"),

	/**
	 * Символ &#191;.
	 */
	IQUEST('¿', "iquest", "191", "BF"),

	/**
	 * Символ &#8464;.
	 */
	ISCR('ℐ', "Iscr", "8464", "2110"),

	/**
	 * Символ &#8712;.
	 */
	ISIN('∈', "isin", "8712", "2208"),

	/**
	 * Символ &#8949;.
	 */
	ISINDOT('⋵', "isindot", "8949", "22F5"),

	/**
	 * Символ &#8953;.
	 */
	ISINE('⋹', "isinE", "8953", "22F9"),

	/**
	 * Символ &#8948;.
	 */
	ISINS('⋴', "isins", "8948", "22F4"),

	/**
	 * Символ &#8947;.
	 */
	ISINSV('⋳', "isinsv", "8947", "22F3"),

	/**
	 * Символ &#296;.
	 */
	ITILDE('Ĩ', "Itilde", "296", "128"),

	/**
	 * Символ &#297;.
	 */
	ITILDE2('ĩ', "itilde", "297", "129"),

	/**
	 * Символ &#239;.
	 */
	IUML('ï', "iuml", "239", "EF"),

	/**
	 * Символ &#308;.
	 */
	JCIRC('Ĵ', "Jcirc", "308", "134"),

	/**
	 * Символ &#309;.
	 */
	JCIRC2('ĵ', "jcirc", "309", "135"),

	/**
	 * Символ &#922;.
	 */
	KAPPA('Κ', "Kappa", "922", "39A"),

	/**
	 * Символ &#954;.
	 */
	KAPPA2('κ', "kappa", "954", "3BA"),

	/**
	 * Символ &#310;.
	 */
	KCEDIL('Ķ', "Kcedil", "310", "136"),

	/**
	 * Символ &#311;.
	 */
	KCEDIL2('ķ', "kcedil", "311", "137"),

	/**
	 * Символ &#312;.
	 */
	KGREEN('ĸ', "kgreen", "312", "138"),

	/**
	 * Символ &#8666;.
	 */
	LAARR('⇚', "lAarr", "8666", "21DA"),

	/**
	 * Символ &#313;.
	 */
	LACUTE('Ĺ', "Lacute", "313", "139"),

	/**
	 * Символ &#314;.
	 */
	LACUTE2('ĺ', "lacute", "314", "13A"),

	/**
	 * Символ &#923;.
	 */
	LAMBDA('Λ', "Lambda", "923", "39B"),

	/**
	 * Символ &#955;.
	 */
	LAMBDA2('λ', "lambda", "955", "3BB"),

	/**
	 * Символ &#9001;.
	 */
	LANG('〈', "lang", "9001", "2329"),

	/**
	 * Символ &#171;.
	 */
	LAQUO('«', "laquo", "171", "AB"),

	/**
	 * Символ &#8656;.
	 */
	LARR('⇐', "lArr", "8656", "21D0"),

	/**
	 * Символ &#8676;.
	 */
	LARRB('⇤', "larrb", "8676", "21E4"),

	/**
	 * Символ &#10527;.
	 */
	LARRBFS('⤟', "larrbfs", "10527", "291F"),

	/**
	 * Символ &#10525;.
	 */
	LARRFS('⤝', "larrfs", "10525", "291D"),

	/**
	 * Символ &#10553;.
	 */
	LARRPL('⤹', "larrpl", "10553", "2939"),

	/**
	 * Символ &#10611;.
	 */
	LARRSIM('⥳', "larrsim", "10611", "2973"),

	/**
	 * Символ &#10521;.
	 */
	LATAIL('⤙', "latail", "10521", "2919"),

	/**
	 * Символ &#10523;.
	 */
	LATAIL2('⤛', "lAtail", "10523", "291B"),

	/**
	 * Символ &#10508;.
	 */
	LBARR('⤌', "lbarr", "10508", "290C"),

	/**
	 * Символ &#10510;.
	 */
	LBARR2('⤎', "lBarr", "10510", "290E"),

	/**
	 * Символ &#10098;.
	 */
	LBBRK('❲', "lbbrk", "10098", "2772"),

	/**
	 * Символ &#123;.
	 */
	LBRACE('{', "lbrace", "123", "7B"),

	/**
	 * Символ &#91;.
	 */
	LBRACK('[', "lbrack", "91", "5B"),

	/**
	 * Символ &#317;.
	 */
	LCARON('Ľ', "Lcaron", "317", "13D"),

	/**
	 * Символ &#318;.
	 */
	LCARON2('ľ', "lcaron", "318", "13E"),

	/**
	 * Символ &#315;.
	 */
	LCEDIL('Ļ', "Lcedil", "315", "13B"),

	/**
	 * Символ &#316;.
	 */
	LCEDIL2('ļ', "lcedil", "316", "13C"),

	/**
	 * Символ &#8968;.
	 */
	LCEIL('⌈', "lceil", "8968", "2308"),

	/**
	 * Символ &#206;.
	 */
	LCIRC('Î', "Lcirc", "206", "CE"),

	/**
	 * Символ &#10550;.
	 */
	LDCA('⤶', "ldca", "10550", "2936"),

	/**
	 * Символ &#8220;.
	 */
	LDQUO('“', "ldquo", "8220", "201C"),

	/**
	 * Символ &#10599;.
	 */
	LDRDHAR('⥧', "ldrdhar", "10599", "2967"),

	/**
	 * Символ &#10571;.
	 */
	LDRUSHAR('⥋', "ldrushar", "10571", "294B"),

	/**
	 * Символ &#8804;.
	 */
	LE('≤', "le", "8804", "2264"),

	/**
	 * Символ &#8806;.
	 */
	LE2('≦', "lE", "8806", "2266"),

	/**
	 * Символ &#10593;.
	 */
	LEFTDOWNTEEVECTOR('⥡', "LeftDownTeeVector", "10593", "2961"),

	/**
	 * Символ &#10585;.
	 */
	LEFTDOWNVECTORBAR('⥙', "LeftDownVectorBar", "10585", "2959"),

	/**
	 * Символ &#10586;.
	 */
	LEFTTEEVECTOR('⥚', "LeftTeeVector", "10586", "295A"),

	/**
	 * Символ &#10577;.
	 */
	LEFTUPDOWNVECTOR('⥑', "LeftUpDownVector", "10577", "2951"),

	/**
	 * Символ &#10592;.
	 */
	LEFTUPTEEVECTOR('⥠', "LeftUpTeeVector", "10592", "2960"),

	/**
	 * Символ &#10584;.
	 */
	LEFTUPVECTORBAR('⥘', "LeftUpVectorBar", "10584", "2958"),

	/**
	 * Символ &#10578;.
	 */
	LEFTVECTORBAR('⥒', "LeftVectorBar", "10578", "2952"),

	/**
	 * Символ &#8922;.
	 */
	LEG('⋚', "leg", "8922", "22DA"),

	/**
	 * Символ &#10620;.
	 */
	LFISHT('⥼', "lfisht", "10620", "297C"),

	/**
	 * Символ &#8970;.
	 */
	LFLOOR('⌊', "lfloor", "8970", "230A"),

	/**
	 * Символ &#8822;.
	 */
	LG('≶', "lg", "8822", "2276"),

	/**
	 * Символ &#204;.
	 */
	LGRAVE('Ì', "Lgrave", "204", "CC"),

	/**
	 * Символ &#10594;.
	 */
	LHAR('⥢', "lHar", "10594", "2962"),

	/**
	 * Символ &#8637;.
	 */
	LHARD('↽', "lhard", "8637", "21BD"),

	/**
	 * Символ &#8636;.
	 */
	LHARU('↼', "lharu", "8636", "21BC"),

	/**
	 * Символ &#10602;.
	 */
	LHARUL('⥪', "lharul", "10602", "296A"),

	/**
	 * Символ &#8920;.
	 */
	LL('⋘', "Ll", "8920", "22D8"),

	/**
	 * Символ &#8647;.
	 */
	LLARR('⇇', "llarr", "8647", "21C7"),

	/**
	 * Символ &#10603;.
	 */
	LLHARD('⥫', "llhard", "10603", "296B"),

	/**
	 * Символ &#319;.
	 */
	LMIDOT('Ŀ', "Lmidot", "319", "13F"),

	/**
	 * Символ &#320;.
	 */
	LMIDOT2('ŀ', "lmidot", "320", "140"),

	/**
	 * Символ &#8808;.
	 */
	LNE('≨', "lnE", "8808", "2268"),

	/**
	 * Символ &#8934;.
	 */
	LNSIM('⋦', "lnsim", "8934", "22E6"),

	/**
	 * Символ &#8701;.
	 */
	LOARR('⇽', "loarr", "8701", "21FD"),

	/**
	 * Символ &#8727;.
	 */
	LOWAST('∗', "lowast", "8727", "2217"),

	/**
	 * Символ &#95;.
	 */
	LOWBAR('_', "lowbar", "95", "5F"),

	/**
	 * Символ &#9674;.
	 */
	LOZ('◊', "loz", "9674", "25CA"),

	/**
	 * Символ &#40;.
	 */
	LPAR('(', "lpar", "40", "28"),

	/**
	 * Символ &#8646;.
	 */
	LRARR('⇆', "lrarr", "8646", "21C6"),

	/**
	 * Символ &#8651;.
	 */
	LRHAR('⇋', "lrhar", "8651", "21CB"),

	/**
	 * Символ &#10605;.
	 */
	LRHARD('⥭', "lrhard", "10605", "296D"),

	/**
	 * Символ &#8206;.
	 */
	LRM('‎', "lrm", "8206", "200E"),

	/**
	 * Символ &#8895;.
	 */
	LRTRI('⊿', "lrtri", "8895", "22BF"),

	/**
	 * Символ &#8249;.
	 */
	LSAQUO('‹', "lsaquo", "8249", "2039"),

	/**
	 * Символ &#8466;.
	 */
	LSCR('ℒ', "Lscr", "8466", "2112"),

	/**
	 * Символ &#8818;.
	 */
	LSIM('≲', "lsim", "8818", "2272"),

	/**
	 * Символ &#8216;.
	 */
	LSQUO('‘', "lsquo", "8216", "2018"),

	/**
	 * Символ &#321;.
	 */
	LSTROK('Ł', "Lstrok", "321", "141"),

	/**
	 * Символ &#322;.
	 */
	LSTROK2('ł', "lstrok", "322", "142"),

	/**
	 * Символ &#60;.
	 */
	LT('<', "lt", "60", "3C"),

	/**
	 * Символ &#8810;.
	 */
	LT2('≪', "Lt", "8810", "226A"),

	/**
	 * Символ &#8918;.
	 */
	LTDOT('⋖', "ltdot", "8918", "22D6"),

	/**
	 * Символ &#8907;.
	 */
	LTHREE('⋋', "lthree", "8907", "22CB"),

	/**
	 * Символ &#8905;.
	 */
	LTIMES('⋉', "ltimes", "8905", "22C9"),

	/**
	 * Символ &#10614;.
	 */
	LTLARR('⥶', "ltlarr", "10614", "2976"),

	/**
	 * Символ &#8884;.
	 */
	LTRIE('⊴', "ltrie", "8884", "22B4"),

	/**
	 * Символ &#207;.
	 */
	LUML('Ï', "Luml", "207", "CF"),

	/**
	 * Символ &#10570;.
	 */
	LURDSHAR('⥊', "lurdshar", "10570", "294A"),

	/**
	 * Символ &#10598;.
	 */
	LURUHAR('⥦', "luruhar", "10598", "2966"),

	/**
	 * Символ &#175;.
	 */
	MACR('¯', "macr", "175", "AF"),

	/**
	 * Символ &#9794;.
	 */
	MALE('♂', "male", "9794", "2642"),

	/**
	 * Символ &#10016;.
	 */
	MALT('✠', "malt", "10016", "2720"),

	/**
	 * Символ &#10501;.
	 */
	MAP('⤅', "Map", "10501", "2905"),

	/**
	 * Символ &#8212;.
	 */
	MDASH('—', "mdash", "8212", "2014"),

	/**
	 * Символ &#8762;.
	 */
	MDDOT('∺', "mDDot", "8762", "223A"),

	/**
	 * Символ &#8487;.
	 */
	MHO('℧', "mho", "8487", "2127"),

	/**
	 * Символ &#181;.
	 */
	MICRO('µ', "micro", "181", "B5"),

	/**
	 * Символ &#8739;.
	 */
	MID('∣', "mid", "8739", "2223"),

	/**
	 * Символ &#183;.
	 */
	MIDDOT('·', "middot", "183", "B7"),

	/**
	 * Символ &#8722;.
	 */
	MINUS('−', "minus", "8722", "2212"),

	/**
	 * Символ &#8863;.
	 */
	MINUSB('⊟', "minusb", "8863", "229F"),

	/**
	 * Символ &#8760;.
	 */
	MINUSD('∸', "minusd", "8760", "2238"),

	/**
	 * Символ &#8723;.
	 */
	MNPLUS('∓', "mnplus", "8723", "2213"),

	/**
	 * Символ &#8871;.
	 */
	MODELS('⊧', "models", "8871", "22A7"),

	/**
	 * Символ &#8499;.
	 */
	MSCR('ℳ', "Mscr", "8499", "2133"),

	/**
	 * Символ &#924;.
	 */
	MU('Μ', "Mu", "924", "39C"),

	/**
	 * Символ &#956;.
	 */
	MU2('μ', "mu", "956", "3BC"),

	/**
	 * Символ &#8888;.
	 */
	MUMAP('⊸', "mumap", "8888", "22B8"),

	/**
	 * Символ &#8711;.
	 */
	NABLA('∇', "nabla", "8711", "2207"),

	/**
	 * Символ &#323;.
	 */
	NACUTE('Ń', "Nacute", "323", "143"),

	/**
	 * Символ &#324;.
	 */
	NACUTE2('ń', "nacute", "324", "144"),

	/**
	 * Символ &#8777;.
	 */
	NAP('≉', "nap", "8777", "2249"),

	/**
	 * Символ &#329;.
	 */
	NAPOS('ŉ', "napos", "329", "149"),

	/**
	 * Символ &#9838;.
	 */
	NATURAL('♮', "natural", "9838", "266E"),

	/**
	 * Символ &#160;.
	 */
	NBSP(' ', "nbsp", "160", "A0"),

	/**
	 * Символ &#327;.
	 */
	NCARON('Ň', "Ncaron", "327", "147"),

	/**
	 * Символ &#328;.
	 */
	NCARON2('ň', "ncaron", "328", "148"),

	/**
	 * Символ &#325;.
	 */
	NCEDIL('Ņ', "Ncedil", "325", "145"),

	/**
	 * Символ &#326;.
	 */
	NCEDIL2('ņ', "ncedil", "326", "146"),

	/**
	 * Символ &#8775;.
	 */
	NCONG('≇', "ncong", "8775", "2247"),

	/**
	 * Символ &#8211;.
	 */
	NDASH('–', "ndash", "8211", "2013"),

	/**
	 * Символ &#8800;.
	 */
	NE('≠', "ne", "8800", "2260"),

	/**
	 * Символ &#10532;.
	 */
	NEARHK('⤤', "nearhk", "10532", "2924"),

	/**
	 * Символ &#8663;.
	 */
	NEARR('⇗', "neArr", "8663", "21D7"),

	/**
	 * Символ &#8802;.
	 */
	NEQUIV('≢', "nequiv", "8802", "2262"),

	/**
	 * Символ &#10536;.
	 */
	NESEAR('⤨', "nesear", "10536", "2928"),

	/**
	 * Символ &#8708;.
	 */
	NEXIST('∄', "nexist", "8708", "2204"),

	/**
	 * Символ &#8817;.
	 */
	NGE('≱', "nge", "8817", "2271"),

	/**
	 * Символ &#8821;.
	 */
	NGSIM('≵', "ngsim", "8821", "2275"),

	/**
	 * Символ &#8815;.
	 */
	NGT('≯', "ngt", "8815", "226F"),

	/**
	 * Символ &#8654;.
	 */
	NHARR('⇎', "nhArr", "8654", "21CE"),

	/**
	 * Символ &#8715;.
	 */
	NI('∋', "ni", "8715", "220B"),

	/**
	 * Символ &#8956;.
	 */
	NIS('⋼', "nis", "8956", "22FC"),

	/**
	 * Символ &#8954;.
	 */
	NISD('⋺', "nisd", "8954", "22FA"),

	/**
	 * Символ &#8653;.
	 */
	NLARR('⇍', "nlArr", "8653", "21CD"),

	/**
	 * Символ &#8229;.
	 */
	NLDR('‥', "nldr", "8229", "2025"),

	/**
	 * Символ &#8816;.
	 */
	NLE('≰', "nle", "8816", "2270"),

	/**
	 * Символ &#8820;.
	 */
	NLSIM('≴', "nlsim", "8820", "2274"),

	/**
	 * Символ &#8814;.
	 */
	NLT('≮', "nlt", "8814", "226E"),

	/**
	 * Символ &#8938;.
	 */
	NLTRI('⋪', "nltri", "8938", "22EA"),

	/**
	 * Символ &#8940;.
	 */
	NLTRIE('⋬', "nltrie", "8940", "22EC"),

	/**
	 * Символ &#8740;.
	 */
	NMID('∤', "nmid", "8740", "2224"),

	/**
	 * Символ &#8469;.
	 */
	NOPF('ℕ', "Nopf", "8469", "2115"),

	/**
	 * Символ &#172;.
	 */
	NOT('¬', "not", "172", "AC"),

	/**
	 * Символ &#8813;.
	 */
	NOTCUPCAP('≭', "NotCupCap", "8813", "226D"),

	/**
	 * Символ &#8713;.
	 */
	NOTIN('∉', "notin", "8713", "2209"),

	/**
	 * Символ &#8951;.
	 */
	NOTINVB('⋷', "notinvb", "8951", "22F7"),

	/**
	 * Символ &#8950;.
	 */
	NOTINVC('⋶', "notinvc", "8950", "22F6"),

	/**
	 * Символ &#8716;.
	 */
	NOTNI('∌', "notni", "8716", "220C"),

	/**
	 * Символ &#8958;.
	 */
	NOTNIVB('⋾', "notnivb", "8958", "22FE"),

	/**
	 * Символ &#8957;.
	 */
	NOTNIVC('⋽', "notnivc", "8957", "22FD"),

	/**
	 * Символ &#8742;.
	 */
	NPAR('∦', "npar", "8742", "2226"),

	/**
	 * Символ &#8832;.
	 */
	NPR('⊀', "npr", "8832", "2280"),

	/**
	 * Символ &#8928;.
	 */
	NPRCUE('⋠', "nprcue", "8928", "22E0"),

	/**
	 * Символ &#8655;.
	 */
	NRARR('⇏', "nrArr", "8655", "21CF"),

	/**
	 * Символ &#8939;.
	 */
	NRTRI('⋫', "nrtri", "8939", "22EB"),

	/**
	 * Символ &#8941;.
	 */
	NRTRIE('⋭', "nrtrie", "8941", "22ED"),

	/**
	 * Символ &#8833;.
	 */
	NSC('⊁', "nsc", "8833", "2281"),

	/**
	 * Символ &#8929;.
	 */
	NSCCUE('⋡', "nsccue", "8929", "22E1"),

	/**
	 * Символ &#8769;.
	 */
	NSIM('≁', "nsim", "8769", "2241"),

	/**
	 * Символ &#8772;.
	 */
	NSIME('≄', "nsime", "8772", "2244"),

	/**
	 * Символ &#8930;.
	 */
	NSQSUBE('⋢', "nsqsube", "8930", "22E2"),

	/**
	 * Символ &#8931;.
	 */
	NSQSUPE('⋣', "nsqsupe", "8931", "22E3"),

	/**
	 * Символ &#8836;.
	 */
	NSUB('⊄', "nsub", "8836", "2284"),

	/**
	 * Символ &#8840;.
	 */
	NSUBE('⊈', "nsube", "8840", "2288"),

	/**
	 * Символ &#8837;.
	 */
	NSUP('⊅', "nsup", "8837", "2285"),

	/**
	 * Символ &#8841;.
	 */
	NSUPE('⊉', "nsupe", "8841", "2289"),

	/**
	 * Символ &#8825;.
	 */
	NTGL('≹', "ntgl", "8825", "2279"),

	/**
	 * Символ &#209;.
	 */
	NTILDE('Ñ', "Ntilde", "209", "D1"),

	/**
	 * Символ &#241;.
	 */
	NTILDE2('ñ', "ntilde", "241", "F1"),

	/**
	 * Символ &#8824;.
	 */
	NTLG('≸', "ntlg", "8824", "2278"),

	/**
	 * Символ &#925;.
	 */
	NU('Ν', "Nu", "925", "39D"),

	/**
	 * Символ &#957;.
	 */
	NU2('ν', "nu", "957", "3BD"),

	/**
	 * Символ &#35;.
	 */
	NUM('#', "num", "35", "23"),

	/**
	 * Символ &#8470;.
	 */
	NUMERO('№', "numero", "8470", "2116"),

	/**
	 * Символ &#8876;.
	 */
	NVDASH('⊬', "nvdash", "8876", "22AC"),

	/**
	 * Символ &#8877;.
	 */
	NVDASH2('⊭', "nvDash", "8877", "22AD"),

	/**
	 * Символ &#8878;.
	 */
	NVDASH3('⊮', "nVdash", "8878", "22AE"),

	/**
	 * Символ &#8879;.
	 */
	NVDASH4('⊯', "nVDash", "8879", "22AF"),

	/**
	 * Символ &#10500;.
	 */
	NVHARR('⤄', "nvHarr", "10500", "2904"),

	/**
	 * Символ &#10498;.
	 */
	NVLARR('⤂', "nvlArr", "10498", "2902"),

	/**
	 * Символ &#10499;.
	 */
	NVRARR('⤃', "nvrArr", "10499", "2903"),

	/**
	 * Символ &#10531;.
	 */
	NWARHK('⤣', "nwarhk", "10531", "2923"),

	/**
	 * Символ &#8662;.
	 */
	NWARR('⇖', "nwArr", "8662", "21D6"),

	/**
	 * Символ &#10535;.
	 */
	NWNEAR('⤧', "nwnear", "10535", "2927"),

	/**
	 * Символ &#211;.
	 */
	OACUTE('Ó', "Oacute", "211", "D3"),

	/**
	 * Символ &#243;.
	 */
	OACUTE2('ó', "oacute", "243", "F3"),

	/**
	 * Символ &#8859;.
	 */
	OAST('⊛', "oast", "8859", "229B"),

	/**
	 * Символ &#8858;.
	 */
	OCIR('⊚', "ocir", "8858", "229A"),

	/**
	 * Символ &#212;.
	 */
	OCIRC('Ô', "Ocirc", "212", "D4"),

	/**
	 * Символ &#244;.
	 */
	OCIRC2('ô', "ocirc", "244", "F4"),

	/**
	 * Символ &#8861;.
	 */
	ODASH('⊝', "odash", "8861", "229D"),

	/**
	 * Символ &#336;.
	 */
	ODBLAC('Ő', "Odblac", "336", "150"),

	/**
	 * Символ &#337;.
	 */
	ODBLAC2('ő', "odblac", "337", "151"),

	/**
	 * Символ &#8857;.
	 */
	ODOT('⊙', "odot", "8857", "2299"),

	/**
	 * Символ &#338;.
	 */
	OELIG('Œ', "OElig", "338", "152"),

	/**
	 * Символ &#339;.
	 */
	OELIG2('œ', "oelig", "339", "153"),

	/**
	 * Символ &#210;.
	 */
	OGRAVE('Ò', "Ograve", "210", "D2"),

	/**
	 * Символ &#242;.
	 */
	OGRAVE2('ò', "ograve", "242", "F2"),

	/**
	 * Символ &#8634;.
	 */
	OLARR('↺', "olarr", "8634", "21BA"),

	/**
	 * Символ &#8254;.
	 */
	OLINE('‾', "oline", "8254", "203E"),

	/**
	 * Символ &#332;.
	 */
	OMACR('Ō', "Omacr", "332", "14C"),

	/**
	 * Символ &#333;.
	 */
	OMACR2('ō', "omacr", "333", "14D"),

	/**
	 * Символ &#937;.
	 */
	OMEGA('Ω', "Omega", "937", "3A9"),

	/**
	 * Символ &#969;.
	 */
	OMEGA2('ω', "omega", "969", "3C9"),

	/**
	 * Символ &#927;.
	 */
	OMICRON('Ο', "Omicron", "927", "39F"),

	/**
	 * Символ &#959;.
	 */
	OMICRON2('ο', "omicron", "959", "3BF"),

	/**
	 * Символ &#8854;.
	 */
	OMINUS('⊖', "ominus", "8854", "2296"),

	/**
	 * Символ &#8853;.
	 */
	OPLUS('⊕', "oplus", "8853", "2295"),

	/**
	 * Символ &#8744;.
	 */
	OR('∨', "or", "8744", "2228"),

	/**
	 * Символ &#8635;.
	 */
	ORARR('↻', "orarr", "8635", "21BB"),

	/**
	 * Символ &#170;.
	 */
	ORDF('ª', "ordf", "170", "AA"),

	/**
	 * Символ &#186;.
	 */
	ORDM('º', "ordm", "186", "BA"),

	/**
	 * Символ &#8886;.
	 */
	ORIGOF('⊶', "origof", "8886", "22B6"),

	/**
	 * Символ &#8500;.
	 */
	OSCR('ℴ', "oscr", "8500", "2134"),

	/**
	 * Символ &#216;.
	 */
	OSLASH('Ø', "Oslash", "216", "D8"),

	/**
	 * Символ &#248;.
	 */
	OSLASH2('ø', "oslash", "248", "F8"),

	/**
	 * Символ &#8856;.
	 */
	OSOL('⊘', "osol", "8856", "2298"),

	/**
	 * Символ &#213;.
	 */
	OTILDE('Õ', "Otilde", "213", "D5"),

	/**
	 * Символ &#245;.
	 */
	OTILDE2('õ', "otilde", "245", "F5"),

	/**
	 * Символ &#8855;.
	 */
	OTIMES('⊗', "otimes", "8855", "2297"),

	/**
	 * Символ &#214;.
	 */
	OUML('Ö', "Ouml", "214", "D6"),

	/**
	 * Символ &#246;.
	 */
	OUML2('ö', "ouml", "246", "F6"),

	/**
	 * Символ &#182;.
	 */
	PARA('¶', "para", "182", "B6"),

	/**
	 * Символ &#8741;.
	 */
	PARALLEL('∥', "parallel", "8741", "2225"),

	/**
	 * Символ &#8706;.
	 */
	PART('∂', "part", "8706", "2202"),

	/**
	 * Символ &#37;.
	 */
	PERCNT('%', "percnt", "37", "25"),

	/**
	 * Символ &#46;.
	 */
	PERIOD('.', "period", "46", "2E"),

	/**
	 * Символ &permil;.
	 */
	PERMIL('', "permil", "137", "89"),

	/**
	 * Символ &#8240;.
	 */
	PERMIL2('‰', "permil", "8240", "2030"),

	/**
	 * Символ &#8869;.
	 */
	PERP('⊥', "perp", "8869", "22A5"),

	/**
	 * Символ &#8241;.
	 */
	PERTENK('‱', "pertenk", "8241", "2031"),

	/**
	 * Символ &#934;.
	 */
	PHI('Φ', "Phi", "934", "3A6"),

	/**
	 * Символ &#966;.
	 */
	PHI2('φ', "phi", "966", "3C6"),

	/**
	 * Символ &#9742;.
	 */
	PHONE('☎', "phone", "9742", "260E"),

	/**
	 * Символ &#928;.
	 */
	PI('Π', "Pi", "928", "3A0"),

	/**
	 * Символ &#960;.
	 */
	PI2('π', "pi", "960", "3C0"),

	/**
	 * Символ &#982;.
	 */
	PIV('ϖ', "piv", "982", "3D6"),

	/**
	 * Символ &#8463;.
	 */
	PLANCK('ℏ', "planck", "8463", "210F"),

	/**
	 * Символ &#8462;.
	 */
	PLANCKH('ℎ', "planckh", "8462", "210E"),

	/**
	 * Символ &#43;.
	 */
	PLUS('+', "plus", "43", "2B"),

	/**
	 * Символ &#8862;.
	 */
	PLUSB('⊞', "plusb", "8862", "229E"),

	/**
	 * Символ &#8724;.
	 */
	PLUSDO('∔', "plusdo", "8724", "2214"),

	/**
	 * Символ &#177;.
	 */
	PLUSMN('±', "plusmn", "177", "B1"),

	/**
	 * Символ &#8473;.
	 */
	POPF('ℙ', "Popf", "8473", "2119"),

	/**
	 * Символ &#163;.
	 */
	POUND('£', "pound", "163", "A3"),

	/**
	 * Символ &#8826;.
	 */
	PR('≺', "pr", "8826", "227A"),

	/**
	 * Символ &#8828;.
	 */
	PRCUE('≼', "prcue", "8828", "227C"),

	/**
	 * Символ &#8242;.
	 */
	PRIME('′', "prime", "8242", "2032"),

	/**
	 * Символ &#8243;.
	 */
	PRIME2('″', "Prime", "8243", "2033"),

	/**
	 * Символ &#8936;.
	 */
	PRNSIM('⋨', "prnsim", "8936", "22E8"),

	/**
	 * Символ &#8719;.
	 */
	PROD('∏', "prod", "8719", "220F"),

	/**
	 * Символ &#8733;.
	 */
	PROP('∝', "prop", "8733", "221D"),

	/**
	 * Символ &#8830;.
	 */
	PRSIM('≾', "prsim", "8830", "227E"),

	/**
	 * Символ &#8880;.
	 */
	PRUREL('⊰', "prurel", "8880", "22B0"),

	/**
	 * Символ &#936;.
	 */
	PSI('Ψ', "Psi", "936", "3A8"),

	/**
	 * Символ &#968;.
	 */
	PSI2('ψ', "psi", "968", "3C8"),

	/**
	 * Символ &#8474;.
	 */
	QOPF('ℚ', "Qopf", "8474", "211A"),

	/**
	 * Символ &#8279;.
	 */
	QPRIME('⁗', "qprime", "8279", "2057"),

	/**
	 * Символ &#63;.
	 */
	QUEST('?', "quest", "63", "3F"),

	/**
	 * Символ &#34;.
	 */
	QUOT('"', "quot", "34", "22"),

	/**
	 * Символ &#8667;.
	 */
	RAARR('⇛', "rAarr", "8667", "21DB"),

	/**
	 * Символ &#340;.
	 */
	RACUTE('Ŕ', "Racute", "340", "154"),

	/**
	 * Символ &#341;.
	 */
	RACUTE2('ŕ', "racute", "341", "155"),

	/**
	 * Символ &#8730;.
	 */
	RADIC('√', "radic", "8730", "221A"),

	/**
	 * Символ &#9002;.
	 */
	RANG('〉', "rang", "9002", "232A"),

	/**
	 * Символ &#187;.
	 */
	RAQUO('»', "raquo", "187", "BB"),

	/**
	 * Символ &#8658;.
	 */
	RARR('⇒', "rArr", "8658", "21D2"),

	/**
	 * Символ &#10613;.
	 */
	RARRAP('⥵', "rarrap", "10613", "2975"),

	/**
	 * Символ &#8677;.
	 */
	RARRB('⇥', "rarrb", "8677", "21E5"),

	/**
	 * Символ &#10528;.
	 */
	RARRBFS('⤠', "rarrbfs", "10528", "2920"),

	/**
	 * Символ &#10526;.
	 */
	RARRFS('⤞', "rarrfs", "10526", "291E"),

	/**
	 * Символ &#10565;.
	 */
	RARRPL('⥅', "rarrpl", "10565", "2945"),

	/**
	 * Символ &#10612;.
	 */
	RARRSIM('⥴', "rarrsim", "10612", "2974"),

	/**
	 * Символ &#10518;.
	 */
	RARRTL('⤖', "Rarrtl", "10518", "2916"),

	/**
	 * Символ &#10522;.
	 */
	RATAIL('⤚', "ratail", "10522", "291A"),

	/**
	 * Символ &#10524;.
	 */
	RATAIL2('⤜', "rAtail", "10524", "291C"),

	/**
	 * Символ &#8758;.
	 */
	RATIO('∶', "ratio", "8758", "2236"),

	/**
	 * Символ &#10509;.
	 */
	RBARR('⤍', "rbarr", "10509", "290D"),

	/**
	 * Символ &#10511;.
	 */
	RBARR2('⤏', "rBarr", "10511", "290F"),

	/**
	 * Символ &#10512;.
	 */
	RBARR3('⤐', "RBarr", "10512", "2910"),

	/**
	 * Символ &#10099;.
	 */
	RBBRK('❳', "rbbrk", "10099", "2773"),

	/**
	 * Символ &#125;.
	 */
	RBRACE('}', "rbrace", "125", "7D"),

	/**
	 * Символ &#93;.
	 */
	RBRACK(']', "rbrack", "93", "5D"),

	/**
	 * Символ &#344;.
	 */
	RCARON('Ř', "Rcaron", "344", "158"),

	/**
	 * Символ &#345;.
	 */
	RCARON2('ř', "rcaron", "345", "159"),

	/**
	 * Символ &#342;.
	 */
	RCEDIL('Ŗ', "Rcedil", "342", "156"),

	/**
	 * Символ &#343;.
	 */
	RCEDIL2('ŗ', "rcedil", "343", "157"),

	/**
	 * Символ &#8969;.
	 */
	RCEIL('⌉', "rceil", "8969", "2309"),

	/**
	 * Символ &#10551;.
	 */
	RDCA('⤷', "rdca", "10551", "2937"),

	/**
	 * Символ &#10601;.
	 */
	RDLDHAR('⥩', "rdldhar", "10601", "2969"),

	/**
	 * Символ &#8221;.
	 */
	RDQUO('”', "rdquo", "8221", "201D"),

	/**
	 * Символ &#8476;.
	 */
	REAL('ℜ', "real", "8476", "211C"),

	/**
	 * Символ &#174;.
	 */
	REG('®', "reg", "174", "AE"),

	/**
	 * Символ &#10621;.
	 */
	RFISHT('⥽', "rfisht", "10621", "297D"),

	/**
	 * Символ &#8971;.
	 */
	RFLOOR('⌋', "rfloor", "8971", "230B"),

	/**
	 * Символ &#10596;.
	 */
	RHAR('⥤', "rHar", "10596", "2964"),

	/**
	 * Символ &#8641;.
	 */
	RHARD('⇁', "rhard", "8641", "21C1"),

	/**
	 * Символ &#8640;.
	 */
	RHARU('⇀', "rharu", "8640", "21C0"),

	/**
	 * Символ &#10604;.
	 */
	RHARUL('⥬', "rharul", "10604", "296C"),

	/**
	 * Символ &#929;.
	 */
	RHO('Ρ', "Rho", "929", "3A1"),

	/**
	 * Символ &#961;.
	 */
	RHO2('ρ', "rho", "961", "3C1"),

	/**
	 * Символ &#10589;.
	 */
	RIGHTDOWNTEEVECTOR('⥝', "RightDownTeeVector", "10589", "295D"),

	/**
	 * Символ &#10581;.
	 */
	RIGHTDOWNVECTORBAR('⥕', "RightDownVectorBar", "10581", "2955"),

	/**
	 * Символ &#10587;.
	 */
	RIGHTTEEVECTOR('⥛', "RightTeeVector", "10587", "295B"),

	/**
	 * Символ &#10575;.
	 */
	RIGHTUPDOWNVECTOR('⥏', "RightUpDownVector", "10575", "294F"),

	/**
	 * Символ &#10588;.
	 */
	RIGHTUPTEEVECTOR('⥜', "RightUpTeeVector", "10588", "295C"),

	/**
	 * Символ &#10580;.
	 */
	RIGHTUPVECTORBAR('⥔', "RightUpVectorBar", "10580", "2954"),

	/**
	 * Символ &#10579;.
	 */
	RIGHTVECTORBAR('⥓', "RightVectorBar", "10579", "2953"),

	/**
	 * Символ &#8644;.
	 */
	RLARR('⇄', "rlarr", "8644", "21C4"),

	/**
	 * Символ &#8652;.
	 */
	RLHAR('⇌', "rlhar", "8652", "21CC"),

	/**
	 * Символ &#8207;.
	 */
	RLM('‏', "rlm", "8207", "200F"),

	/**
	 * Символ &#8702;.
	 */
	ROARR('⇾', "roarr", "8702", "21FE"),

	/**
	 * Символ &#8477;.
	 */
	ROPF('ℝ', "Ropf", "8477", "211D"),

	/**
	 * Символ &#10608;.
	 */
	ROUNDIMPLIES('⥰', "RoundImplies", "10608", "2970"),

	/**
	 * Символ &#41;.
	 */
	RPAR(')', "rpar", "41", "29"),

	/**
	 * Символ &#8649;.
	 */
	RRARR('⇉', "rrarr", "8649", "21C9"),

	/**
	 * Символ &#8250;.
	 */
	RSAQUO('›', "rsaquo", "8250", "203A"),

	/**
	 * Символ &#8475;.
	 */
	RSCR('ℛ', "Rscr", "8475", "211B"),

	/**
	 * Символ &#8217;.
	 */
	RSQUO('’', "rsquo", "8217", "2019"),

	/**
	 * Символ &#8908;.
	 */
	RTHREE('⋌', "rthree", "8908", "22CC"),

	/**
	 * Символ &#8906;.
	 */
	RTIMES('⋊', "rtimes", "8906", "22CA"),

	/**
	 * Символ &#8885;.
	 */
	RTRIE('⊵', "rtrie", "8885", "22B5"),

	/**
	 * Символ &#10600;.
	 */
	RULUHAR('⥨', "ruluhar", "10600", "2968"),

	/**
	 * Символ &#8478;.
	 */
	RX('℞', "rx", "8478", "211E"),

	/**
	 * Символ &#346;.
	 */
	SACUTE('Ś', "Sacute", "346", "15A"),

	/**
	 * Символ &#347;.
	 */
	SACUTE2('ś', "sacute", "347", "15B"),

	/**
	 * Символ &#8218;.
	 */
	SBQUO('‚', "sbquo", "8218", "201A"),

	/**
	 * Символ &#8827;.
	 */
	SC('≻', "sc", "8827", "227B"),

	/**
	 * Символ &#352;.
	 */
	SCARON('Š', "Scaron", "352", "160"),

	/**
	 * Символ &#353;.
	 */
	SCARON2('š', "scaron", "353", "161"),

	/**
	 * Символ &#8829;.
	 */
	SCCUE('≽', "sccue", "8829", "227D"),

	/**
	 * Символ &#350;.
	 */
	SCEDIL('Ş', "Scedil", "350", "15E"),

	/**
	 * Символ &#351;.
	 */
	SCEDIL2('ş', "scedil", "351", "15F"),

	/**
	 * Символ &#348;.
	 */
	SCIRC('Ŝ', "Scirc", "348", "15C"),

	/**
	 * Символ &#349;.
	 */
	SCIRC2('ŝ', "scirc", "349", "15D"),

	/**
	 * Символ &#8937;.
	 */
	SCNSIM('⋩', "scnsim", "8937", "22E9"),

	/**
	 * Символ &#8831;.
	 */
	SCSIM('≿', "scsim", "8831", "227F"),

	/**
	 * Символ &#8901;.
	 */
	SDOT('⋅', "sdot", "8901", "22C5"),

	/**
	 * Символ &#8865;.
	 */
	SDOTB('⊡', "sdotb", "8865", "22A1"),

	/**
	 * Символ &#10533;.
	 */
	SEARHK('⤥', "searhk", "10533", "2925"),

	/**
	 * Символ &#8664;.
	 */
	SEARR('⇘', "seArr", "8664", "21D8"),

	/**
	 * Символ &#167;.
	 */
	SECT('§', "sect", "167", "A7"),

	/**
	 * Символ &#59;.
	 */
	SEMI(';', "semi", "59", "3B"),

	/**
	 * Символ &#10537;.
	 */
	SESWAR('⤩', "seswar", "10537", "2929"),

	/**
	 * Символ &#8726;.
	 */
	SETMINUS('∖', "setminus", "8726", "2216"),

	/**
	 * Символ &#10038;.
	 */
	SEXT('✶', "sext", "10038", "2736"),

	/**
	 * Символ &#9839;.
	 */
	SHARP('♯', "sharp", "9839", "266F"),

	/**
	 * Символ &#173;.
	 */
	SHY('­', "shy", "173", "AD"),

	/**
	 * Символ &#931;.
	 */
	SIGMA('Σ', "Sigma", "931", "3A3"),

	/**
	 * Символ &#963;.
	 */
	SIGMA2('σ', "sigma", "963", "3C3"),

	/**
	 * Символ &#962;.
	 */
	SIGMAF('ς', "sigmaf", "962", "3C2"),

	/**
	 * Символ &#8764;.
	 */
	SIM('∼', "sim", "8764", "223C"),

	/**
	 * Символ &#8771;.
	 */
	SIME('≃', "sime", "8771", "2243"),

	/**
	 * Символ &#8774;.
	 */
	SIMNE('≆', "simne", "8774", "2246"),

	/**
	 * Символ &#10610;.
	 */
	SIMRARR('⥲', "simrarr", "10610", "2972"),

	/**
	 * Символ &#47;.
	 */
	SOL('/', "sol", "47", "2F"),

	/**
	 * Символ &#9824;.
	 */
	SPADES('♠', "spades", "9824", "2660"),

	/**
	 * Символ &#8851;.
	 */
	SQCAP('⊓', "sqcap", "8851", "2293"),

	/**
	 * Символ &#8852;.
	 */
	SQCUP('⊔', "sqcup", "8852", "2294"),

	/**
	 * Символ &#8847;.
	 */
	SQSUB('⊏', "sqsub", "8847", "228F"),

	/**
	 * Символ &#8849;.
	 */
	SQSUBE('⊑', "sqsube", "8849", "2291"),

	/**
	 * Символ &#8848;.
	 */
	SQSUP('⊐', "sqsup", "8848", "2290"),

	/**
	 * Символ &#8850;.
	 */
	SQSUPE('⊒', "sqsupe", "8850", "2292"),

	/**
	 * Символ &#8902;.
	 */
	STAR('⋆', "Star", "8902", "22C6"),

	/**
	 * Символ &#9734;.
	 */
	STAR2('☆', "star", "9734", "2606"),

	/**
	 * Символ &#9733;.
	 */
	STARF('★', "starf", "9733", "2605"),

	/**
	 * Символ &#8834;.
	 */
	SUB('⊂', "sub", "8834", "2282"),

	/**
	 * Символ &#8912;.
	 */
	SUB2('⋐', "Sub", "8912", "22D0"),

	/**
	 * Символ &#8838;.
	 */
	SUBE('⊆', "sube", "8838", "2286"),

	/**
	 * Символ &#8842;.
	 */
	SUBNE('⊊', "subne", "8842", "228A"),

	/**
	 * Символ &#10617;.
	 */
	SUBRARR('⥹', "subrarr", "10617", "2979"),

	/**
	 * Символ &#8721;.
	 */
	SUM('∑', "sum", "8721", "2211"),

	/**
	 * Символ &#9834;.
	 */
	SUNG('♪', "sung", "9834", "266A"),

	/**
	 * Символ &#185;.
	 */
	SUP1('¹', "sup1", "185", "B9"),

	/**
	 * Символ &#178;.
	 */
	SUP2('²', "sup2", "178", "B2"),

	/**
	 * Символ &#179;.
	 */
	SUP3('³', "sup3", "179", "B3"),

	/**
	 * Символ &#8835;.
	 */
	SUP('⊃', "sup", "8835", "2283"),

	/**
	 * Символ &#8913;.
	 */
	SUP4('⋑', "Sup", "8913", "22D1"),

	/**
	 * Символ &#8839;.
	 */
	SUPE('⊇', "supe", "8839", "2287"),

	/**
	 * Символ &#10619;.
	 */
	SUPLARR('⥻', "suplarr", "10619", "297B"),

	/**
	 * Символ &#8843;.
	 */
	SUPNE('⊋', "supne", "8843", "228B"),

	/**
	 * Символ &#10534;.
	 */
	SWARHK('⤦', "swarhk", "10534", "2926"),

	/**
	 * Символ &#8665;.
	 */
	SWARR('⇙', "swArr", "8665", "21D9"),

	/**
	 * Символ &#10538;.
	 */
	SWNWAR('⤪', "swnwar", "10538", "292A"),

	/**
	 * Символ &#223;.
	 */
	SZLIG('ß', "szlig", "223", "DF"),

	/**
	 * Символ &#932;.
	 */
	TAU('Τ', "Tau", "932", "3A4"),

	/**
	 * Символ &#964;.
	 */
	TAU2('τ', "tau", "964", "3C4"),

	/**
	 * Символ &#356;.
	 */
	TCARON('Ť', "Tcaron", "356", "164"),

	/**
	 * Символ &#357;.
	 */
	TCARON2('ť', "tcaron", "357", "165"),

	/**
	 * Символ &#354;.
	 */
	TCEDIL('Ţ', "Tcedil", "354", "162"),

	/**
	 * Символ &#355;.
	 */
	TCEDIL2('ţ', "tcedil", "355", "163"),

	/**
	 * Символ &#8756;.
	 */
	THERE4('∴', "there4", "8756", "2234"),

	/**
	 * Символ &#920;.
	 */
	THETA('Θ', "Theta", "920", "398"),

	/**
	 * Символ &#952;.
	 */
	THETA2('θ', "theta", "952", "3B8"),

	/**
	 * Символ &#977;.
	 */
	THETASYM('ϑ', "thetasym", "977", "3D1"),

	/**
	 * Символ &#8201;.
	 */
	THINSP(' ', "thinsp", "8201", "2009"),

	/**
	 * Символ &#222;.
	 */
	THORN('Þ', "THORN", "222", "DE"),

	/**
	 * Символ &#254;.
	 */
	THORN2('þ', "thorn", "254", "FE"),

	/**
	 * Символ &#126;.
	 */
	TILDE('~', "tilde", "126", "7E"),

	/**
	 * Символ &#215;.
	 */
	TIMES('×', "times", "215", "D7"),

	/**
	 * Символ &#8864;.
	 */
	TIMESB('⊠', "timesb", "8864", "22A0"),

	/**
	 * Символ &#8868;.
	 */
	TOP('⊤', "top", "8868", "22A4"),

	/**
	 * Символ &#8244;.
	 */
	TPRIME('‴', "tprime", "8244", "2034"),

	/**
	 * Символ &#8482;.
	 */
	TRADE('™', "trade", "8482", "2122"),

	/**
	 * Символ &#8796;.
	 */
	TRIE('≜', "trie", "8796", "225C"),

	/**
	 * Символ &#358;.
	 */
	TSTROK('Ŧ', "Tstrok", "358", "166"),

	/**
	 * Символ &#359;.
	 */
	TSTROK2('ŧ', "tstrok", "359", "167"),

	/**
	 * Символ &#218;.
	 */
	UACUTE('Ú', "Uacute", "218", "DA"),

	/**
	 * Символ &#250;.
	 */
	UACUTE2('ú', "uacute", "250", "FA"),

	/**
	 * Символ &#8657;.
	 */
	UARR('⇑', "uArr", "8657", "21D1"),

	/**
	 * Символ &#10569;.
	 */
	UARROCIR('⥉', "Uarrocir", "10569", "2949"),

	/**
	 * Символ &#364;.
	 */
	UBREVE('Ŭ', "Ubreve", "364", "16C"),

	/**
	 * Символ &#365;.
	 */
	UBREVE2('ŭ', "ubreve", "365", "16D"),

	/**
	 * Символ &#219;.
	 */
	UCIRC('Û', "Ucirc", "219", "DB"),

	/**
	 * Символ &#251;.
	 */
	UCIRC2('û', "ucirc", "251", "FB"),

	/**
	 * Символ &#8645;.
	 */
	UDARR('⇅', "udarr", "8645", "21C5"),

	/**
	 * Символ &#368;.
	 */
	UDBLAC('Ű', "Udblac", "368", "170"),

	/**
	 * Символ &#369;.
	 */
	UDBLAC2('ű', "udblac", "369", "171"),

	/**
	 * Символ &#10606;.
	 */
	UDHAR('⥮', "udhar", "10606", "296E"),

	/**
	 * Символ &#10622;.
	 */
	UFISHT('⥾', "ufisht", "10622", "297E"),

	/**
	 * Символ &#217;.
	 */
	UGRAVE('Ù', "Ugrave", "217", "D9"),

	/**
	 * Символ &#249;.
	 */
	UGRAVE2('ù', "ugrave", "249", "F9"),

	/**
	 * Символ &#10595;.
	 */
	UHAR('⥣', "uHar", "10595", "2963"),

	/**
	 * Символ &#8639;.
	 */
	UHARL('↿', "uharl", "8639", "21BF"),

	/**
	 * Символ &#8638;.
	 */
	UHARR('↾', "uharr", "8638", "21BE"),

	/**
	 * Символ &#362;.
	 */
	UMACR('Ū', "Umacr", "362", "16A"),

	/**
	 * Символ &#363;.
	 */
	UMACR2('ū', "umacr", "363", "16B"),

	/**
	 * Символ &#168;.
	 */
	UML('¨', "uml", "168", "A8"),

	/**
	 * Символ &#370;.
	 */
	UOGON('Ų', "Uogon", "370", "172"),

	/**
	 * Символ &#371;.
	 */
	UOGON2('ų', "uogon", "371", "173"),

	/**
	 * Символ &#10514;.
	 */
	UPARROWBAR('⤒', "UpArrowBar", "10514", "2912"),

	/**
	 * Символ &#8846;.
	 */
	UPLUS('⊎', "uplus", "8846", "228E"),

	/**
	 * Символ &#978;.
	 */
	UPSIH('ϒ', "upsih", "978", "3D2"),

	/**
	 * Символ &#933;.
	 */
	UPSILON('Υ', "Upsilon", "933", "3A5"),

	/**
	 * Символ &#965;.
	 */
	UPSILON2('υ', "upsilon", "965", "3C5"),

	/**
	 * Символ &#366;.
	 */
	URING('Ů', "Uring", "366", "16E"),

	/**
	 * Символ &#367;.
	 */
	URING2('ů', "uring", "367", "16F"),

	/**
	 * Символ &#8944;.
	 */
	UTDOT('⋰', "utdot", "8944", "22F0"),

	/**
	 * Символ &#360;.
	 */
	UTILDE('Ũ', "Utilde", "360", "168"),

	/**
	 * Символ &#361;.
	 */
	UTILDE2('ũ', "utilde", "361", "169"),

	/**
	 * Символ &#8648;.
	 */
	UUARR('⇈', "uuarr", "8648", "21C8"),

	/**
	 * Символ &#220;.
	 */
	UUML('Ü', "Uuml", "220", "DC"),

	/**
	 * Символ &#252;.
	 */
	UUML2('ü', "uuml", "252", "FC"),

	/**
	 * Символ &#8661;.
	 */
	VARR('⇕', "vArr", "8661", "21D5"),

	/**
	 * Символ &#8866;.
	 */
	VDASH('⊢', "vdash", "8866", "22A2"),

	/**
	 * Символ &#8872;.
	 */
	VDASH2('⊨', "vDash", "8872", "22A8"),

	/**
	 * Символ &#8873;.
	 */
	VDASH3('⊩', "Vdash", "8873", "22A9"),

	/**
	 * Символ &#8875;.
	 */
	VDASH4('⊫', "VDash", "8875", "22AB"),

	/**
	 * Символ &#8891;.
	 */
	VEEBAR('⊻', "veebar", "8891", "22BB"),

	/**
	 * Символ &#8794;.
	 */
	VEEEQ('≚', "veeeq", "8794", "225A"),

	/**
	 * Символ &#8942;.
	 */
	VELLIP('⋮', "vellip", "8942", "22EE"),

	/**
	 * Символ &#124;.
	 */
	VERT('|', "vert", "124", "7C"),

	/**
	 * Символ &#8214;.
	 */
	VERT2('‖', "Vert", "8214", "2016"),

	/**
	 * Символ &#10072;.
	 */
	VERTICALSEPARATOR('❘', "VerticalSeparator", "10072", "2758"),

	/**
	 * Символ &#8882;.
	 */
	VLTRI('⊲', "vltri", "8882", "22B2"),

	/**
	 * Символ &#8883;.
	 */
	VRTRI('⊳', "vrtri", "8883", "22B3"),

	/**
	 * Символ &#8874;.
	 */
	VVDASH('⊪', "Vvdash", "8874", "22AA"),

	/**
	 * Символ &#372;.
	 */
	WCIRC('Ŵ', "Wcirc", "372", "174"),

	/**
	 * Символ &#373;.
	 */
	WCIRC2('ŵ', "wcirc", "373", "175"),

	/**
	 * Символ &#8793;.
	 */
	WEDGEQ('≙', "wedgeq", "8793", "2259"),

	/**
	 * Символ &#8472;.
	 */
	WEIERP('℘', "weierp", "8472", "2118"),

	/**
	 * Символ &#8768;.
	 */
	WREATH('≀', "wreath", "8768", "2240"),

	/**
	 * Символ &#8898;.
	 */
	XCAP('⋂', "xcap", "8898", "22C2"),

	/**
	 * Символ &#8899;.
	 */
	XCUP('⋃', "xcup", "8899", "22C3"),

	/**
	 * Символ &#10231;.
	 */
	XHARR('⟷', "xharr", "10231", "27F7"),

	/**
	 * Символ &#10234;.
	 */
	XHARR2('⟺', "xhArr", "10234", "27FA"),

	/**
	 * Символ &#926;.
	 */
	XI('Ξ', "Xi", "926", "39E"),

	/**
	 * Символ &#958;.
	 */
	XI2('ξ', "xi", "958", "3BE"),

	/**
	 * Символ &#10229;.
	 */
	XLARR('⟵', "xlarr", "10229", "27F5"),

	/**
	 * Символ &#10232;.
	 */
	XLARR2('⟸', "xlArr", "10232", "27F8"),

	/**
	 * Символ &#10236;.
	 */
	XMAP('⟼', "xmap", "10236", "27FC"),

	/**
	 * Символ &#8955;.
	 */
	XNIS('⋻', "xnis", "8955", "22FB"),

	/**
	 * Символ &#10230;.
	 */
	XRARR('⟶', "xrarr", "10230", "27F6"),

	/**
	 * Символ &#10233;.
	 */
	XRARR2('⟹', "xrArr", "10233", "27F9"),

	/**
	 * Символ &#8897;.
	 */
	XVEE('⋁', "xvee", "8897", "22C1"),

	/**
	 * Символ &#8896;.
	 */
	XWEDGE('⋀', "xwedge", "8896", "22C0"),

	/**
	 * Символ &#221;.
	 */
	YACUTE('Ý', "Yacute", "221", "DD"),

	/**
	 * Символ &#253;.
	 */
	YACUTE2('ý', "yacute", "253", "FD"),

	/**
	 * Символ &#374;.
	 */
	YCIRC('Ŷ', "Ycirc", "374", "176"),

	/**
	 * Символ &#375;.
	 */
	YCIRC2('ŷ', "ycirc", "375", "177"),

	/**
	 * Символ &#165;.
	 */
	YEN('¥', "yen", "165", "A5"),

	/**
	 * Символ &#255;.
	 */
	YUML('ÿ', "yuml", "255", "FF"),

	/**
	 * Символ &#376;.
	 */
	YUML2('Ÿ', "Yuml", "376", "178"),

	/**
	 * Символ &#377;.
	 */
	ZACUTE('Ź', "Zacute", "377", "179"),

	/**
	 * Символ &#378;.
	 */
	ZACUTE2('ź', "zacute", "378", "17A"),

	/**
	 * Символ &#381;.
	 */
	ZCARON('Ž', "Zcaron", "381", "17D"),

	/**
	 * Символ &#382;.
	 */
	ZCARON2('ž', "zcaron", "382", "17E"),

	/**
	 * Символ &#379;.
	 */
	ZDOT('Ż', "Zdot", "379", "17B"),

	/**
	 * Символ &#380;.
	 */
	ZDOT2('ż', "zdot", "380", "17C"),

	/**
	 * Символ &#918;.
	 */
	ZETA('Ζ', "Zeta", "918", "396"),

	/**
	 * Символ &#950;.
	 */
	ZETA2('ζ', "zeta", "950", "3B6"),

	/**
	 * Символ &#8488;.
	 */
	ZFR('ℨ', "Zfr", "8488", "2128"),

	/**
	 * Символ &#8668;.
	 */
	ZIGLARR('⇜', "ziglarr", "8668", "21DC"),

	/**
	 * Символ &#8669;.
	 */
	ZIGRARR('⇝', "zigrarr", "8669", "21DD"),

	/**
	 * Символ &#8484;.
	 */
	ZOPF('ℤ', "Zopf", "8484", "2124"),

	/**
	 * Символ &#8205;.
	 */
	ZWJ('‍', "zwj", "8205", "200D"),

	/**
	 * Символ &#8204;.
	 */
	ZWNJ('‌', "zwnj", "8204", "200C");

	/**
	 * Специальный символ.
	 */
	@NotNull
	private final Character symbol;

	/**
	 * HTML-сущность специального символа в виде имени.
	 */
	@NotNull
	private final String name;

	/**
	 * HTML-сущность специального символа в виде числа.
	 */
	@NotNull
	private final String numeric;

	/**
	 * HTML-сущность специального символа в виде unicode.
	 */
	@NotNull
	private final String unicode;

	/**
	 * Конструктор для {@code Entity}.
	 *
	 * @param symbol специальный символ.
	 * @param name HTML-сущность специального символа в виде имени.
	 * @param numeric HTML-сущность специального символа в виде числа.
	 * @param unicode HTML-сущность специального символа в виде unicode.
	 */
	Entity(@NotNull final Character symbol,
		   @NotNull final String name,
		   @NotNull final String numeric,
		   @NotNull final String unicode)
	{
		this.symbol = symbol;
		this.name = name;
		this.numeric = numeric;
		this.unicode = unicode;
	}

	/**
	 * Возвращает специальный символ.
	 *
	 * @return специальный символ.
	 */
	@NotNull
	public Character getSymbol()
	{
		return this.symbol;
	}

	/**
	 * Возвращает HTML-сущность специального символа в указанном типе.
	 *
	 * @param entityType тип HTML-сущности.
	 * @return HTML-сущность специального символа.
	 */
	@NotNull
	public String getEntity(@NotNull final EntityType entityType)
	{
		return switch (entityType)
			{
				case NAME: yield this.getEntityName();
				case NUMERIC: yield this.getEntityNumeric();
				case UNICODE: yield this.getEntityUnicode();
			};
	}

	/**
	 * Возвращает HTML-сущность специального символа в виде имени.
	 *
	 * @return HTML-сущность специального символа в виде имени.
	 */
	@NotNull
	public String getEntityName()
	{
		return this.name;
	}

	/**
	 * Возвращает HTML-сущность специального символа в виде числа.
	 *
	 * @return HTML-сущность специального символа в виде числа.
	 */
	@NotNull
	public String getEntityNumeric()
	{
		return this.numeric;
	}

	/**
	 * Возвращает HTML-сущность специального символа в виде unicode.
	 *
	 * @return HTML-сущность специального символа в виде unicode.
	 */
	@NotNull
	public String getEntityUnicode()
	{
		return this.unicode;
	}

	/**
	 * Возвращает HTML-сущность специального символа в указанном типе.
	 *
	 * @param entityType тип HTML-сущности.
	 * @return HTML-сущность специального символа.
	 */
	@NotNull
	public String getMnemonic(@NotNull final EntityType entityType)
	{
		return switch (entityType)
			{
				case NAME: yield this.getMnemonicName();
				case NUMERIC: yield this.getMnemonicNumeric();
				case UNICODE: yield this.getMnemonicUnicode();
			};
	}

	/**
	 * Возвращает HTML-сущность специального символа в виде имени.
	 *
	 * @return HTML-сущность специального символа в виде имени.
	 */
	@NotNull
	public String getMnemonicName()
	{
		return "&" + this.name + ";";
	}

	/**
	 * Возвращает HTML-сущность специального символа в виде числа.
	 *
	 * @return HTML-сущность специального символа в виде числа.
	 */
	@NotNull
	public String getMnemonicNumeric()
	{
		return "&#" + this.numeric + ";";
	}

	/**
	 * Возвращает HTML-сущность специального символа в виде unicode.
	 *
	 * @return HTML-сущность специального символа в виде unicode.
	 */
	@NotNull
	public String getMnemonicUnicode()
	{
		return "&#X" + this.unicode + ";";
	}
}
